export const LLMToolResult1 = JSON.stringify({
    step_1: {
      dataSourceStep: 0,
      qa:{
        question:'题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。',
        answerList:[
          {
            order: 1,
            answer: '金百味',
          },
          {
            order: 2,
            answer:
              '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
            
          },
          {
            order: 3,
            answer:
              '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
          
          },
          {
            order: 4,
            answer:
              '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
                  
          },
        ]
      },
      result: [{
        sort:[
            [2],
            [1,3],
            [4]
          ],
       
        answerList: [
          {
            order: 1,
            answer: '金百味',
            score: 1,
            indicatorScore: {
              readability: 1,
              unReadability: 2,
            },
            indicatorDetermine: {
              sensitiveInfo: true,
            },
          },
          {
            order: 2,
            answer:
              '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
            score: 2,
            indicatorScore: {
              readability: 1,
              unReadability: 3,
            },
            indicatorDetermine: {
              sensitiveInfo: true,
            },
          },
          {
            order: 3,
            answer:
              '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
            score: 2,
            indicatorScore: {
              readability: 1,
            },
            indicatorDetermine: {
              sensitiveInfo: true,
            },
          },
          {
            order: 4,
            answer:
              '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
            score: 2,
            indicatorScore: {
              readability: 1,
            },
            indicatorDetermine: {
              sensitiveInfo: true,
              sensitiveInfo2: false,
            },
          },
        ],
        textAttribute:'文件'
      }],
      toolName: 'LLMTool',
    },
  });

export const LLMToolQa =   {
    question:
      '题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。',
    answerList: [
      {
        order: 1,
        answer: '金百味',
      },
      {
        order: 2,
        answer:
          '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
      },
      {
        order: 3,
        answer:
          '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
      },
      {
        order: 4,
        answer:
          '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
      },
    ],
  }
