export const LLMToolResult = {
  step_1: {
    dataSourceStep: 0,

    result: [
      {
        sort: [],
        answerList: [
          {
            order: 1,
            answer: `$E=mc^2$`,
          },
          {
            order: 2,
            answer: '全刀手',
          },
          {
            order: 3,
            answer: '费大厨',
          },
          {
            order: 4,
            answer:
              '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
          },
        ],
        textAttribute: '文件',
      },
    ],
    toolName: 'LLMTool',
  },
};

export const LLMToolQa = {
  question:
    "sidebar_position: 1\n## 版本记录\n### 普通公式\n$E=mc^2$\n~~~js\nconsole.log('It works!')\n~~~\n\nA paragraph with *emphasis* and **strong importance**.\n> A block quote with ~strikethrough~ and a URL: https://reactjs.org.\n\nA table:\n| a | b |\n| - | - |\n",
  answerList: [
    {
      order: 1,
      answer: `$E=mc^2$`,
    },
    {
      order: 2,
      answer: '全刀手 。',
    },
    {
      order: 3,
      answer: '费大厨',
    },
    {
      order: 4,
      answer:
        '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
    },
  ],
};
