export const LLMToolResult = {
    step_1: {
      dataSourceStep: 0,

      result: [{
        sort:[],
        answerList: [
          {
            order: 1,
            answer: '金百味',           
          },
          {
            order: 2,
            answer:
              '全刀手',             
          },
          {
            order: 3,
            answer:
              '费大厨',
          },
          {
            order: 4,
            answer:
              '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。', 
          },
        ],
        textAttribute:'文件'
      }],
      toolName: 'LLMTool',
    },
  };

export const LLMToolQa =   {
    question:
      '题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。题目限制最多二百字。',
    answerList: [
      {
        order: 1,
        answer: '金百味',
      },
      {
        order: 2,
        answer:
          '全刀手 。',
      },
      {
        order: 3,
        answer:
          '费大厨',
      },
      {
        order: 4,
        answer:
          '案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。我是答案1，我限1000个字符。',
      },
    ],
  }
